
/*---------------------------------------------------------------------*/
/* --- 电子秤(HX711)入门级教程 ----------------------------------------*/
/* --- MCU：STC89C52RC ------------------------------------------------*/
/* --- 作者：深圳小余电子 ---------------------------------------------*/
/* --- 来源：https://nmcu.taobao.com/----------------------------------*/
/* --- 本例程支持串口打印,外部晶振11.0592 , 波特率为9600---------------*/
/* --- 如果要在程序中使用此代码,请在程序中注明使用了作者的资料及程序 --*/
/*---------------------------------------------------------------------*/

#include "LCD1602.h"

//****************************************************
//MS延时函数
//****************************************************
void LCD1602_delay_ms(unsigned int n)
{
	unsigned int  i,j;
	for(i=0;i<n;i++)
		for(j=0;j<123;j++);
}

//****************************************************
//写指令
//****************************************************
void LCD1602_write_com(unsigned char com)
{
	LCD1602_RS = 0;
	LCD1602_delay_ms(1);
	LCD1602_EN = 1;
	LCD1602_PORT = com;
	LCD1602_delay_ms(1);
	LCD1602_EN = 0;
}

//****************************************************
//写数据
//****************************************************
void LCD1602_write_data(unsigned char dat)
{
	LCD1602_RS = 1;
	LCD1602_delay_ms(1);	
	LCD1602_PORT = dat;
	LCD1602_EN = 1;
	LCD1602_delay_ms(1);
	LCD1602_EN = 0;
}

//****************************************************
//连续写字符
//****************************************************
void LCD1602_write_word(unsigned char *s)
{
	while(*s>0)
	{
		LCD1602_write_data(*s);
		s++;
	}
}

void Init_LCD1602()
{
	LCD1602_EN = 0;
	LCD1602_RW = 0;						    //设置为写状态
	LCD1602_write_com(0x38);			//显示模式设定
	LCD1602_write_com(0x0c);			//开关显示、光标有无设置、光标闪烁设置
	LCD1602_write_com(0x06);			//写一个字符后指针加一
	LCD1602_write_com(0x01);			//清屏指令
}


