
/*---------------------------------------------------------------------*/
/* --- 电子秤(HX711)入门级教程 ----------------------------------------*/
/* --- MCU：STC89C52RC ------------------------------------------------*/
/* --- 作者：深圳小余电子 ---------------------------------------------*/
/* --- 来源：https://nmcu.taobao.com/----------------------------------*/
/* --- 本例程支持串口打印,外部晶振11.0592 , 波特率为9600---------------*/
/* --- 如果要在程序中使用此代码,请在程序中注明使用了作者的资料及程序 --*/
/*---------------------------------------------------------------------*/
#include "Sprint.h"


void Uart_Init()	 //MCU：STC89C52RC   晶振：11.0592   波特率：9600	  			   
{
	SCON = 0X50;  //UART方式1；8位UART
	REN  = 0;     //不允许串行口接收数据
	PCON = 0x00;  //SMOD=0;波特率不加倍
	TMOD = 0x21;  //T1方式2，用于产生波特率
	TH1  = 0xFD;  //装初值
	TL1  = 0xFD;
	TR1  = 1;     //启动定时器1
	EA   = 1;     //打开全局中断控制
	ES   = 0;     //串行口中断	
}

void UartPutc(unsigned char dat)
{
    SBUF = dat;
    while(TI==0);
    TI = 0;
}

char putchar(char c)
{
    UartPutc(c);
    return c;
}





















