#ifndef _EXTI_H
#define _EXTI_H
#include "sys.h"
//////////////////////////////////////////////////////////////////////////////////	 

//外部中断驱动代码	   


//STM32H7工程模板-HAL库函数版本
//DevEBox  大越创新
//淘宝店铺：mcudev.taobao.com
//淘宝店铺：shop389957290.taobao.com						  
////////////////////////////////////////////////////////////////////////////////// 	

void EXTI_Init(void); //外部中断初始化

#endif
































/***************************************************************************************/

//STM32H7工程模板-HAL库函数版本
//DevEBox  大越创新
//淘宝店铺：mcudev.taobao.com
//淘宝店铺：shop389957290.taobao.com	

/***************************************************************************************/








