#ifndef __DAC_H
#define __DAC_H
#include "sys.h"
//////////////////////////////////////////////////////////////////////////////////	 
/**********************************************************************/

//DAC驱动代码	 

//STM32H7工程模板-HAL库函数版本
//DevEBox  大越创新
//淘宝店铺：mcudev.taobao.com
//淘宝店铺：shop389957290.taobao.com	
/*********************************************************************/							  
////////////////////////////////////////////////////////////////////////////////// 	

extern DAC_HandleTypeDef DAC1_Handler;//DAC句柄

void DAC1_Init(void);
void DAC1_Set_Vol(u16 vol);
#endif



























/**********************************************************************/

//DAC驱动代码	 

//STM32H7工程模板-HAL库函数版本
//DevEBox  大越创新
//淘宝店铺：mcudev.taobao.com
//淘宝店铺：shop389957290.taobao.com	
/*********************************************************************/	










